storage/tests/fae10a13-fcc3-4014-9257-6c1db724b316/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/fae10a13-fcc3-4014-9257-6c1db724b316/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

running (11.0s), 08/10 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (12.0s), 06/10 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (13.0s), 05/10 VUs, 5 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (14.0s), 03/10 VUs, 7 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 50     3.456374/s
    checks_succeeded...: 80.00% 40 out of 50
    checks_failed......: 20.00% 10 out of 50

    ✗ status ok
      ↳  80% — ✓ 40 / ✗ 10

    HTTP
    http_req_duration..............: avg=199.88ms min=4.59ms med=9.91ms max=998.7ms p(90)=710.06ms p(95)=791.72ms
      { expected_response:true }...: avg=89.31ms  min=4.59ms med=8ms    max=381.7ms p(90)=338.44ms p(95)=347.29ms
    http_req_failed................: 20.00% 10 out of 50
    http_reqs......................: 50     3.456374/s

    EXECUTION
    iteration_duration.............: avg=12.71s   min=10.18s med=13.24s max=14.46s  p(90)=14.35s   p(95)=14.4s   
    iterations.....................: 10     0.691275/s
    vus............................: 3      min=3        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 27 kB  1.9 kB/s
    data_sent......................: 15 kB  1.0 kB/s



running (14.5s), 00/10 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s